> # no difference
> compare_character(c("a", "b"), c("a", "b"))
v No differences

> # single change
> compare_character(c("a", "b", "c"), c("a", "b"))
`x`: "a" "b" "c"
`y`: "a" "b"    

> compare_character(c("a", "b"), c("a", "b", "c"))
`x`: "a" "b"    
`y`: "a" "b" "c"

> compare_character(c("a", "B", "c"), c("a", "b", "c"))
`x`: "a" "B" "c"
`y`: "a" "b" "c"

> # multiple contexts
> compare_character(c("a", "b", letters, "a", "b", "c", letters, "X"), c("a", "b",
+   "c", letters, "a", "b", letters, "Y"))
`x[1:5]`: "a" "b"     "a" "b" "c"
`y[1:6]`: "a" "b" "c" "a" "b" "c"

`x[28:34]`: "z" "a" "b" "c" "a" "b" "c"
`y[29:34]`: "z" "a" "b"     "a" "b" "c"

`x[55:58]`: "x" "y" "z" "X"
`y[55:58]`: "x" "y" "z" "Y"

> # truncation
> compare_character(c("X", letters), letters)
`x[1:4]`: "X" "a" "b" "c"
`y[1:3]`:     "a" "b" "c"

> compare_character(c(letters, "X"), letters)
`x[24:27]`: "x" "y" "z" "X"
`y[24:26]`: "x" "y" "z"    

