> # no difference
> diff_element(c("a", "b"), c("a", "b"))
v No differences

> # single change
> diff_element(c("a", "b", "c"), c("a", "b"))
`x`: "a" "b" "c"
`y`: "a" "b"    

> diff_element(c("a", "b"), c("a", "b", "c"))
`x`: "a" "b"    
`y`: "a" "b" "c"

> diff_element(c("a", "B", "c"), c("a", "b", "c"))
`x`: "a" "B" "c"
`y`: "a" "b" "c"

> # multiple contexts
> diff_element(c("a", "b", letters, "a", "b", "c", letters, "X"), c("a", "b", "c",
+   letters, "a", "b", letters, "Y"))
`x[1:5]`: "a" "b"     "a" "b" "c" ...
`y`:      "a" "b" "c" "a" "b" "c" ...

`x[28:34]`: ... "z" "a" "b" "c" "a" "b" "c" ...
`y`:        ... "z" "a" "b"     "a" "b" "c" ...

`x[55:58]`: ... "x" "y" "z" "X"
`y`:        ... "x" "y" "z" "Y"

> # truncation
> diff_element(c("X", letters), letters)
`x[1:4]`: "X" "a" "b" "c" ...
`y`:          "a" "b" "c" ...

> diff_element(c(letters, "X"), letters)
`x[24:27]`: ... "x" "y" "z" "X"
`y`:        ... "x" "y" "z"    

